In [1]:
!conda list | grep pandas

pandas                    1.3.4            py39h743cdd8_0

>pandas 설치 여부 확인 \
> Conda(패키지 관리 시스템) 의 설치 리스트에 pandas 가 존재하는지 검색
---

In [2]:
import pandas as pd

>pandas 를 import 하고 ps 라는 단축어로 사용
---

## pd.read_csv('파일 주소')

### *.csv 파일 불러오기

In [3]:
pd.read_csv('./data/friend_list.csv')

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

>*.csv 파일 불러오기 - pd.read_csv('\*.cvs 파일 주소')
---

In [4]:
df=pd.read_csv('./data/friend_list.csv')

In [5]:
pd.read_csv('./data/friend_list.csv').head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [6]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

>.head(?) 데이터의 하위 ?개 항목을 보여줌 \
.head() 데이터의 하위 5개 항목을 보여줌
---

In [7]:
pd.read_csv('./data/friend_list.csv').tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [8]:
df.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

>.tail(?) 데이터의 하위 ?개 항목을 보여줌 \
.tail() 데이터의 하위 5개 항목을 보여줌
---

In [9]:
pd.read_csv('./data/friend_list_no_head.csv')

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

>header가 없는 파일 불러오는 경우 발생하는 Error
---

In [10]:
pd.read_csv('./data/friend_list_no_head.csv', header = None)

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

>header 가 없는 파일 불러오기 \
>pd.read_csv('파일 주소pd.read_csv('./data/friend_list_no_head.csv', header = None)', header = None)
---

In [11]:
df_no_head = pd.read_csv('./data/friend_list_no_head.csv', header = None)

In [12]:
df_no_head.columns = ['name', 'age', 'job']

In [13]:
df_no_head

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

>header 가 없는 파일에 header 만들기 \
>pd.read_csv('파일 주소pd.read_csv('./data/friend_list_no_head.csv', header = None)', header = None)
---

In [14]:
pd.read_csv('./data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

>header 가 없는 파일을 header 만들면서 불러오기 \
>pd.read_csv('./data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
---

### *.txt 파일 불러오기

In [15]:
pd.read_csv('./data/friend_list.txt')

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

>데이터가 ',' 으로 구분된 *.txt 파일 불러오기 \
>*.txt 파일 불러오기 - pd.read_csv('\*.txt 파일 주소')
---

In [16]:
pd.read_csv('./data/friend_list_tab.txt')

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

>데이터가 tab 으로 구분된 *.txt 파일 불러오는 경우 발생하는 Error
---

In [17]:
pd.read_csv('./data/friend_list_tab.txt', delimiter = '\t')

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

>데이터가 tab 으로 구분된 *.txt 파일 불러오기 \
>*.txt 파일 불러오기 - pd.read_csv('\*.txt 파일 주소', delimiter = '\t')
---